Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.postFakeFlagsChangedEvents
source: Post fake flags-changed events when remapping modifiers with an event tap. This is an attempt to work around incompatibilities with AltTab in issue 10220.
de: Beim Umbelegen von Modifizierertasten über einen Event-Tap fingierte Flags-Changed-Ereignisse senden. Dies ist ein Versuch, Inkompatibilitäten mit AltTab in Issue 10220 zu umgehen.
ja: イベントタップで修飾キーを再マッピングする際、疑似的なフラグ変更イベントを送信する。 これはissue 10220にあるAltTabとの非互換性の回避策です。
pt_br: Publicar eventos falsos de alteração de flags ao remapear modificadores com um event tap. Esta é uma tentativa de contornar incompatibilidades com o AltTab no problema 10220.
ru: Отправлять поддельные события flags-changed при переназначении модификаторов через event tap. Это попытка обойти несовместимость с AltTab, описанную в issue 10220.
zh_hans: 在通过事件点击重新映射修饰键时，发布虚假的“flags-changed”事件？ 这是针对 issue 10220中 AltTab不兼容问题的解决方案。

# AdvancedSetting.preconvertStringsOnParserThread
source: Pre-convert non-ASCII strings to screen characters on the parser thread. This exploits parallelism between parsing and screen mutation for better performance.
de: Nicht-ASCII-Strings im Parser-Thread vorab in Bildschirmzeichen umwandeln. Dies nutzt die Parallelität zwischen Parsen und Bildschirmänderung für bessere Leistung.
ja: パーサースレッド上で非ASCII文字列を事前に画面文字へ変換する。 これは解析と画面の変更の間の並列性を利用してパフォーマンスを向上させます。
pt_br: Pré-converter strings não ASCII em caracteres de tela na thread do analisador. Isto aproveita o paralelismo entre a análise e a mutação da tela para melhor desempenho.
ru: Заранее преобразовывать не-ASCII строки в экранные символы в потоке синтаксического анализа. Это использует параллелизм между разбором и изменением экрана для повышения производительности.
zh_hans: 在解析线程上，在转换非ASCII字符串为屏幕字符之前进行预处理？ 此功能利用解析和屏幕修改的并行性以提高性能。

# AdvancedSetting.preferredBaseDir
source: Folder for config files. There must not be a space in the path. If empty, then ~/.config/iterm2 will be the default location.
de: Ordner für Konfigurationsdateien. Der Pfad darf kein Leerzeichen enthalten. Wenn leer, ist ~/.config/iterm2 der Standardspeicherort.
ja: 設定ファイル用のフォルダ。パスにスペースを含めることはできません。 空欄の場合、デフォルトの場所は ~/.config/iterm2 になります。
pt_br: Pasta para arquivos de configuração. Não deve haver espaço no caminho. Se vazio, ~/.config/iterm2 será o local padrão.
ru: Папка для файлов конфигурации. Путь не должен содержать пробелов. Если поле пустое, по умолчанию используется ~/.config/iterm2.
zh_hans: 配置文件的文件夹。路径中不得有空格。 如果为空，则默认位置为 ~/.config/iterm2。

# AdvancedSetting.preferSpeedToFullLigatureSupport
source: Improves drawing performance at the expense of disallowing alphanumeric characters to belong to ligatures.
de: Verbessert die Zeichenleistung, verhindert dabei jedoch, dass alphanumerische Zeichen Teil von Ligaturen sein können.
ja: 英数字がリガチャーに含まれることを許可しない代わりに、描画パフォーマンスを向上させます。
pt_br: Melhora o desempenho de desenho ao custo de não permitir que caracteres alfanuméricos pertençam a ligaduras.
ru: Повышает производительность отрисовки за счёт запрета буквенно-цифровым символам входить в лигатуры.
zh_hans: 通过禁止字母数字字符属于连字，提升绘图性能。

# AdvancedSetting.preserveFontSizeOnAutomaticProfileSwitch
source: Preserve font zoom level when Automatic Profile Switching changes profiles.
de: Schriftzoomstufe beibehalten, wenn Automatic Profile Switching das Profil wechselt.
ja: Automatic Profile Switchingでプロファイルが切り替わった際にフォントのズームレベルを保持する。
pt_br: Preservar o nível de zoom da fonte quando a Troca automática de perfil muda de perfil.
ru: Сохранять масштаб шрифта при смене профиля функцией автоматического переключения профилей.
zh_hans: 当自动配置文件切换更改配置文件时，保留字体缩放级别。

# AdvancedSetting.preventEscapeSequenceFromChangingProfile
source: Prevent control sequences from changing the current profile?
de: Verhindern, dass Steuersequenzen das aktuelle Profil ändern?
ja: 制御シーケンスによる現在のプロファイルの変更を防止するか？
pt_br: Impedir que sequências de controle alterem o perfil atual?
ru: Запретить управляющим последовательностям изменять текущий профиль?
zh_hans: 防止控制序列改变当前配置文件？

# AdvancedSetting.preventEscapeSequenceFromClearingHistory
source: Prevent CSI 3 J from clearing scrollback history? This is also known as the terminfo E3 capability.
de: Verhindern, dass CSI 3 J den Scrollback-Verlauf leert? Dies ist auch als terminfo-Fähigkeit E3 bekannt.
ja: CSI 3 Jによるスクロールバック履歴のクリアを防止するか？ これはterminfoのE3機能としても知られています。
pt_br: Impedir que CSI 3 J limpe o histórico de rolagem? Isto também é conhecido como a capacidade E3 do terminfo.
ru: Запретить последовательности CSI 3 J очищать историю прокрутки? Это также известно как возможность E3 в terminfo.
zh_hans: 防止 CSI 3 J清除滚动历史记录？ 这也被称为 terminfo E3 功能。

# AdvancedSetting.preventSleepOnBatteryToo
source: Prevent system idle sleep on battery too, for profiles with “Prevent sleep” enabled? By default the “Prevent sleep” profile setting only prevents idle sleep while connected to power. Enable this to also prevent idle sleep on battery.
de: Auch im Akkubetrieb den Ruhezustand des Systems verhindern, für Profile mit aktivierter Einstellung „Ruhezustand verhindern“? Standardmäßig verhindert die Profileinstellung „Ruhezustand verhindern“ den Ruhezustand nur bei Netzbetrieb. Aktivieren Sie dies, um den Ruhezustand auch im Akkubetrieb zu verhindern.
ja: 「スリープを防止する」が有効なプロファイルについて、バッテリー駆動時もシステムのアイドルスリープを防止するか？ デフォルトでは、プロファイルの「スリープを防止する」設定は電源に接続されている間のみアイドルスリープを防止します。バッテリー駆動時にもアイドルスリープを防止するにはこれを有効にしてください。
pt_br: Impedir o modo de repouso ocioso do sistema também na bateria, para perfis com “Impedir repouso” ativado? Por padrão, o ajuste de perfil “Impedir repouso” só impede o repouso ocioso enquanto conectado à energia. Ative isto para impedir o repouso ocioso também na bateria.
ru: Предотвращать переход системы в спящий режим по бездействию также при работе от батареи, для профилей с включённым параметром «Предотвращать переход в спящий режим»? По умолчанию параметр профиля «Предотвращать переход в спящий режим» предотвращает переход в спящий режим по бездействию только при питании от сети. Включите этот параметр, чтобы это действовало и при работе от батареи.
zh_hans: 对于启用了“防止睡眠”的配置文件，是否也禁止电池供电时的系统空闲休眠？ 默认情况下，“防止睡眠”配置仅能在连接电源时禁止空闲休眠。启用此功能可同时禁止电池供电时的空闲休眠。

# AdvancedSetting.prioritizeSmartSelectionActions
source: Check smart selection actions before existing files on cmd-click?
de: Bei ⌘-Klick Smart-Selection-Aktionen vor vorhandenen Dateien prüfen?
ja: cmdクリック時、既存のファイルより先にSmart Selectionアクションをチェックするか？
pt_br: Verificar as ações de seleção inteligente antes dos arquivos existentes ao clicar com cmd?
ru: Проверять действия умного выделения (Smart Selection) раньше существующих файлов при Cmd-щелчке?
zh_hans: 在 cmd-click点击现有文件前，检查智能选取操作？

# AdvancedSetting.profilesWindowJoinsActiveSpace
source: If the Profiles window is open, it always moves to join the active Space. You must restart iTerm2 for a change in this setting to take effect.
de: Wenn das Fenster „Profile“ geöffnet ist, wechselt es immer zum aktiven Space. Sie müssen iTerm2 neu starten, damit eine Änderung dieser Einstellung wirksam wird.
ja: Profilesウィンドウが開いている場合、常にアクティブなSpaceへ移動する。 この設定の変更を反映させるにはiTerm2を再起動する必要があります。
pt_br: Se a janela Perfis estiver aberta, ela sempre se move para o Space ativo. Você precisa reiniciar o iTerm2 para que uma alteração neste ajuste tenha efeito.
ru: Если окно «Профили» открыто, оно всегда перемещается в активное пространство (Space). Чтобы изменение этого параметра вступило в силу, необходимо перезапустить iTerm2.
zh_hans: 如果 Profiles 窗口打开，它总是移动到当前 Space 中。 必须重启 iTerm2，此设置才会生效。

# AdvancedSetting.promptForPasteWhenNotAtPrompt
source: Warn before pasting when not at shell prompt?
de: Vor dem Einfügen warnen, wenn nicht an der Shell-Eingabeaufforderung?
ja: シェルプロンプトにいないときに貼り付けを行うと警告するか？
pt_br: Avisar antes de colar quando não estiver no prompt do shell?
ru: Предупреждать перед вставкой, если вы не находитесь в командной строке оболочки?
zh_hans: 在不在 shell提示符时，粘贴前发出警告？

# AdvancedSetting.proportionalScrollWheelReporting
source: Report multiple mouse scroll events when scrolling quickly?
de: Bei schnellem Scrollen mehrere Mausrad-Ereignisse melden?
ja: 素早くスクロールしたとき、複数のマウススクロールイベントを報告するか？
pt_br: Relatar múltiplos eventos de rolagem do mouse ao rolar rapidamente?
ru: Сообщать о нескольких событиях прокрутки мыши при быстрой прокрутке?
zh_hans: 快速滚动时报告多个鼠标滚动事件？

# AdvancedSetting.pythonRuntimeBetaDownloadURL
source: URL to check for new Beta versions of the Python scripting runtime.
de: URL zum Prüfen auf neue Betaversionen der Python-Skript-Laufzeitumgebung.
ja: Pythonスクリプトランタイムの新しいベータ版を確認するためのURL。
pt_br: URL para verificar novas versões Beta do runtime de scripts do Python.
ru: URL-адрес для проверки новых бета-версий среды выполнения сценариев Python.
zh_hans: 检查 Python脚本运行时新Beta版本的URL。

# AdvancedSetting.pythonRuntimeDownloadURL
source: URL to check for new versions of the Python scripting runtime.
de: URL zum Prüfen auf neue Versionen der Python-Skript-Laufzeitumgebung.
ja: Pythonスクリプトランタイムの新しいバージョンを確認するためのURL。
pt_br: URL para verificar novas versões do runtime de scripts do Python.
ru: URL-адрес для проверки новых версий среды выполнения сценариев Python.
zh_hans: 检查Python脚本运行时新版本的URL。

# AdvancedSetting.pythonRuntimeUsesUV
source: Use uv to provision the Python runtime for API scripts? When enabled, iTerm2 uses uv to download Python and build per-script environments instead of the bundled Python runtime. Scripts already provisioned continue to run regardless of this setting; it only affects creating, importing, and migrating scripts.
de: uv zum Bereitstellen der Python-Laufzeitumgebung für API-Skripte verwenden? Wenn aktiviert, verwendet iTerm2 uv, um Python herunterzuladen und pro Skript eigene Umgebungen zu erstellen, anstatt die mitgelieferte Python-Laufzeitumgebung zu verwenden. Bereits bereitgestellte Skripte laufen unabhängig von dieser Einstellung weiter; sie wirkt sich nur auf das Erstellen, Importieren und Migrieren von Skripten aus.
ja: APIスクリプト用のPythonランタイムの準備にuvを使用するか？ 有効にすると、iTerm2は同梱のPythonランタイムの代わりにuvを使用してPythonをダウンロードし、スクリプトごとの環境を構築します。すでに準備済みのスクリプトはこの設定に関わらず引き続き動作します。この設定はスクリプトの作成、インポート、移行にのみ影響します。
pt_br: Usar o uv para provisionar o runtime do Python para scripts da API? Quando ativado, o iTerm2 usa o uv para baixar o Python e criar ambientes por script em vez do runtime do Python incorporado. Scripts já provisionados continuam a ser executados independentemente deste ajuste; ele afeta apenas a criação, importação e migração de scripts.
ru: Использовать uv для подготовки среды выполнения Python для сценариев API? Если включено, iTerm2 использует uv для загрузки Python и создания отдельных окружений для каждого сценария вместо встроенной среды выполнения Python. Уже подготовленные сценарии продолжат работать независимо от этого параметра; он влияет только на создание, импорт и перенос сценариев.
zh_hans: 使用uv为API脚本提供Python运行时？ 启用后，iTerm2将使用uv下载Python并构建每个脚本的环境，而不是使用捆绑的Python运行时。已准备的脚本仍可正常运行，此设置仅影响脚本的创建、导入和迁移。

# AdvancedSetting.quickPasteBytesPerCall
source: Number of bytes to paste in each chunk when pasting normally.
de: Anzahl der Bytes, die bei normalem Einfügen pro Abschnitt eingefügt werden.
ja: 通常のペースト時に1回のチャンクで貼り付けるバイト数。
pt_br: Número de bytes a colar em cada bloco ao colar normalmente.
ru: Число байтов, вставляемых за один блок при обычной вставке.
zh_hans: 正常粘贴时，每块中需要粘贴的字节数。

# AdvancedSetting.quickPasteDelayBetweenCalls
source: Delay in seconds between chunks when pasting normally.
de: Verzögerung in Sekunden zwischen Abschnitten bei normalem Einfügen.
ja: 通常のペースト時にチャンク間で置く遅延（秒）。
pt_br: Atraso em segundos entre blocos ao colar normalmente.
ru: Задержка в секундах между блоками при обычной вставке.
zh_hans: 正常粘贴时，各块之间的延迟（秒数）。

# AdvancedSetting.remapModifiersWithoutEventTap
source: Disable remapping modifiers for system shortcuts. This prevents asking for accessibility permission. It breaks remapping system shortcuts like cmd-tab.
de: Umbelegen von Modifizierertasten für Systemtastenkombinationen deaktivieren. Dadurch entfällt die Abfrage der Bedienungshilfen-Berechtigung. Das Umbelegen von Systemtastenkombinationen wie Cmd-Tab funktioniert dadurch nicht mehr.
ja: システムショートカットの修飾キー再マッピングを無効にする。 これによりアクセシビリティ権限の要求を防げます。ただし、cmd-tabのようなシステムショートカットの再マッピングが機能しなくなります。
pt_br: Desativar o remapeamento de modificadores para atalhos do sistema. Isto evita solicitar permissão de acessibilidade. Isto quebra o remapeamento de atalhos do sistema como cmd-tab.
ru: Отключить переназначение модификаторов для системных сочетаний клавиш. Это предотвращает запрос разрешения специальных возможностей. При этом перестаёт работать переназначение системных сочетаний клавиш, например cmd-tab.
zh_hans: 禁用系统快捷键的映射转换。 这可以防止请求无障碍权限，同时会破坏如cmd-tab这样的快捷键映射功能。

# AdvancedSetting.rememberTmuxWindowSizes
source: Remember window sizes in tmux integration? Requires tmux 2.9 or later. The “variable window size” advanced setting must be enabled.
de: Fenstergrößen bei der tmux-Integration merken? Erfordert tmux 2.9 oder höher. Die erweiterte Einstellung „Variable Fenstergröße“ muss aktiviert sein.
ja: tmux統合でウィンドウサイズを記憶するか？ tmux 2.9以降が必要です。「可変ウィンドウサイズ」詳細設定を有効にする必要があります。
pt_br: Lembrar os tamanhos das janelas na integração do tmux? Requer tmux 2.9 ou posterior. O ajuste avançado “tamanho de janela variável” deve estar ativado.
ru: Запоминать размеры окон при интеграции с tmux? Требуется tmux версии 2.9 или новее. Должен быть включён дополнительный параметр «variable window size».
zh_hans: 在tmux集成中是否记得窗口大小？ 需要使用tmux 2.9或更高版本。必须启用“变量窗口大小”高级设置。

# AdvancedSetting.removeAddTabButton
source: Remove the “new tab” button from horizontal tab bars?
de: Die Schaltfläche „Neuer Tab“ aus horizontalen Tableisten entfernen?
ja: 水平タブバーから「新規タブ」ボタンを削除するか？
pt_br: Remover o botão “nova aba” das barras de abas horizontais?
ru: Убрать кнопку «новая вкладка» с горизонтальных панелей вкладок?
zh_hans: 是否移除水平标签页栏中的“新标签页”按钮？

# AdvancedSetting.reportOnFirstMouse
source: Send mouse reports when you click in a window that isn't already frontmouse?
de: Mausmeldungen senden, wenn Sie in ein Fenster klicken, das noch nicht im Vordergrund ist?
ja: 最前面ではないウィンドウをクリックしたときにマウス報告を送信するか？
pt_br: Enviar relatos de mouse ao clicar em uma janela que ainda não está sob o foco do mouse?
ru: Отправлять сообщения о мыши при щелчке в окне, которое ещё не находится на переднем плане?
zh_hans: 当在尚未启用frontmouse的窗口中点击时，是否发送鼠标报告？

# AdvancedSetting.requireCmdForDraggingText
source: To drag images or selected text, you must hold ⌘. This prevents accidental drags.
de: Um Bilder oder ausgewählten Text zu ziehen, müssen Sie ⌘ gedrückt halten. Dies verhindert versehentliches Ziehen.
ja: 画像や選択したテキストをドラッグするには⌘を押しておく必要があります。これにより誤ったドラッグを防止します。
pt_br: Para arrastar imagens ou texto selecionado, você precisa manter ⌘ pressionado. Isto evita arrastos acidentais.
ru: Чтобы перетаскивать изображения или выделенный текст, нужно удерживать ⌘. Это предотвращает случайные перетаскивания.
zh_hans: 拖动图片或选中文本时，必须按住⌘键。这可以防止意外拖动。

# AdvancedSetting.requireOptionToDragSplitPaneTitleBar
source: Require Option to be pressed to drag a split pane by its title bar? This helps prevent accidental drags.
de: Erfordern, dass die Wahltaste (Option) gedrückt wird, um einen Split-Bereich an seiner Titelleiste zu ziehen? Dies hilft, versehentliches Ziehen zu verhindern.
ja: 分割ペインをタイトルバーからドラッグするにはOptionキーを押す必要がありますか？ これにより誤ったドラッグを防止できます。
pt_br: Exigir que Option esteja pressionado para arrastar um painel dividido pela sua barra de título? Isto ajuda a evitar arrastos acidentais.
ru: Требовать нажатия Option для перетаскивания разделённой панели за заголовок? Это помогает предотвратить случайные перетаскивания.
zh_hans: 是否要求按下Option键才能通过标题栏拖动分屏窗格？ 这有助于防止意外拖动。

# AdvancedSetting.requireSlashInURLGuess
source: Only consider a two+ part domain-name to be a URL if it also contains a slash. This setting is used when guessing if a string is a URL for semantic history. When enabled, `example.com` would not be considered a URL but `example.com/` would be.
de: Einen Domainnamen mit zwei oder mehr Teilen nur dann als URL betrachten, wenn er auch einen Schrägstrich enthält. Diese Einstellung wird verwendet, um zu erraten, ob ein String für Semantic History eine URL ist. Wenn aktiviert, würde `example.com` nicht als URL gelten, `example.com/` hingegen schon.
ja: 2つ以上のパートを持つドメイン名について、スラッシュも含まれる場合のみURLとみなす。 この設定はSemantic Historyの文字列がURLかどうかを推測する際に使用されます。有効にすると、`example.com`はURLとみなされませんが、`example.com/`はURLとみなされます。
pt_br: Considerar um nome de domínio com duas ou mais partes como URL apenas se também contiver uma barra. Este ajuste é usado ao adivinhar se uma string é uma URL para o Semantic History. Quando ativado, `example.com` não seria considerado uma URL, mas `example.com/` seria.
ru: Считать доменное имя из двух и более частей URL-адресом, только если оно также содержит косую черту. Этот параметр используется при определении того, является ли строка URL-адресом для «Семантической истории». Если включено, `example.com` не будет считаться URL-адресом, а `example.com/` — будет.
zh_hans: 只有当域名包含斜杠时，才将其视为URL。 此设置用于判断字符串是否为URL，以保留语义历史记录。启用后，`example.com`不会被视为URL，而`example.com/`会。

# AdvancedSetting.resetSGROnPrompt
source: Reset colors at shell prompt? Uses shell integration to detect a shell prompt and, if enabled, resets colors to their defaults.
de: Farben an der Shell-Eingabeaufforderung zurücksetzen? Verwendet Shell Integration, um eine Shell-Eingabeaufforderung zu erkennen, und setzt bei Aktivierung die Farben auf ihre Standardwerte zurück.
ja: シェルプロンプトで色をリセットするか？ Shell Integrationを使ってシェルプロンプトを検出し、有効な場合は色をデフォルトにリセットします。
pt_br: Redefinir as cores no prompt do shell? Usa o Shell Integration para detectar um prompt do shell e, se ativado, redefine as cores para os padrões.
ru: Сбрасывать цвета в командной строке оболочки? Использует Shell Integration для определения командной строки и, если включено, сбрасывает цвета к значениям по умолчанию.
zh_hans: 在shell提示符下是否重置颜色？ 使用shell集成来检测shell提示符，若启用则将颜色重置为默认设置。

# AdvancedSetting.restoreKeyModeAutomaticallyOnHostChange
source: Automatically restore keyboard mode when an ssh session ends?
de: Tastaturmodus automatisch wiederherstellen, wenn eine SSH-Sitzung endet?
ja: sshセッションが終了したときに自動的にキーボードモードを復元するか？
pt_br: Restaurar automaticamente o modo de teclado quando uma sessão ssh termina?
ru: Автоматически восстанавливать режим клавиатуры по завершении сеанса ssh?
zh_hans: 当ssh会话结束时是否自动恢复键盘模式？

# AdvancedSetting.restoreWindowContents
source: Restore window contents at startup. This requires “System Settings > Desktop & Dock > Close windows when quitting an app” to be off.
de: Fensterinhalte beim Start wiederherstellen. Dies erfordert, dass „Systemeinstellungen > Schreibtisch & Dock > Fenster beim Beenden einer App schließen“ deaktiviert ist.
ja: 起動時にウィンドウの内容を復元する。 これには「システム設定 > デスクトップとDock > アプリケーション終了時にウィンドウを閉じる」がオフになっている必要があります。
pt_br: Restaurar o conteúdo das janelas na inicialização. Isto requer que “Ajustes do Sistema > Mesa e Dock > Fechar janelas ao encerrar um app” esteja desativado.
ru: Восстанавливать содержимое окон при запуске. Для этого параметр «Системные настройки > Рабочий стол и Dock > Закрывать окна при выходе из приложения» должен быть выключен.
zh_hans: 启动时是否恢复窗口内容。 这要求“系统设置 > 桌面与 Dock > 关闭应用时窗口”选项被禁用。

# AdvancedSetting.restoreWindowsWithinScreens
source: When restoring a window arrangement, ensure windows are entirely within the bounds of the current displays.
de: Beim Wiederherstellen einer Fensteranordnung sicherstellen, dass sich Fenster vollständig innerhalb der Grenzen der aktuellen Bildschirme befinden.
ja: ウィンドウ配置を復元する際、ウィンドウが現在のディスプレイの範囲内に完全に収まるようにする。
pt_br: Ao restaurar um arranjo de janelas, garantir que as janelas fiquem inteiramente dentro dos limites das telas atuais.
ru: При восстановлении расстановки окон следить, чтобы окна полностью помещались в границы текущих дисплеев.
zh_hans: 在恢复窗口排列时，确保窗口完全位于当前显示范围内。

# AdvancedSetting.restrictSemanticHistoryPrefixAndSuffixToLogicalWindow
source: Respect soft boundaries for computing the prefix and suffix text passed to semantic history commands? Due to a long-standing bug this did not used to be respected. Soft boundaries were always respected for deciding what text was clicked on, but the prefix and suffix did not. If you have a semantic history command that depends on the bug, you can switch this off to get the pre-3.1.2 behavior.
de: Weiche Grenzen beim Berechnen des an Semantic-History-Befehle übergebenen Präfix- und Suffix-Texts berücksichtigen? Aufgrund eines seit Langem bestehenden Fehlers wurde dies bisher nicht berücksichtigt. Weiche Grenzen wurden immer berücksichtigt, um zu bestimmen, auf welchen Text geklickt wurde, jedoch nicht für Präfix und Suffix. Wenn Sie einen Semantic-History-Befehl haben, der von diesem Fehler abhängt, können Sie dies deaktivieren, um das Verhalten vor Version 3.1.2 zu erhalten.
ja: Semantic Historyコマンドに渡す接頭辞・接尾辞テキストの計算でソフト境界を尊重するか？ 長年のバグにより、これまでは尊重されていませんでした。どのテキストがクリックされたかを判定する際はソフト境界が常に尊重されていましたが、接頭辞・接尾辞には反映されていませんでした。このバグに依存するSemantic Historyコマンドがある場合、これをオフにすることでバージョン3.1.2以前の動作に戻せます。
pt_br: Respeitar limites flexíveis ao calcular o texto de prefixo e sufixo passado aos comandos do Semantic History? Devido a um bug antigo, isto não costumava ser respeitado. Os limites flexíveis eram sempre respeitados para decidir em qual texto foi clicado, mas o prefixo e o sufixo não. Se você tem um comando do Semantic History que depende do bug, pode desativar isto para obter o comportamento anterior à 3.1.2.
ru: Учитывать мягкие границы при вычислении текста-префикса и текста-суффикса, передаваемых командам «Семантической истории»? Из-за давней ошибки это раньше не учитывалось. Мягкие границы всегда учитывались при определении того, по какому тексту произошёл щелчок, но не для префикса и суффикса. Если ваша команда «Семантической истории» зависит от этой ошибки, можно выключить этот параметр, чтобы получить поведение, как до версии 3.1.2.
zh_hans: 在计算传递给语义历史命令的前缀和后缀文本时，是否尊重软边界？ 由于长期存在的bug，此功能以前未被尊重。软边界始终被尊重用于判断点击了什么文本，但前缀和后缀则没有。如果某个语义历史命令依赖于此bug，可以关闭此功能以恢复3.1.2之前的行为。

# AdvancedSetting.retinaInlineImages
source: Show inline images at Retina resolution.
de: Inline-Bilder in Retina-Auflösung anzeigen.
ja: インライン画像をRetina解像度で表示する。
pt_br: Mostrar imagens embutidas na resolução Retina.
ru: Показывать встроенные изображения в разрешении Retina.
zh_hans: 在Retina分辨率下显示内联图片。

# AdvancedSetting.revealExportedSettingsAndData
source: Reveal file created by “Export All Settings and Data” in finder upon completion
de: Die von „Alle Einstellungen und Daten exportieren“ erstellte Datei nach Abschluss im Finder anzeigen
ja: 「すべての設定とデータをエクスポート」が完了したとき、作成されたファイルをFinderで表示する
pt_br: Revelar no Finder o arquivo criado por “Exportar todos os ajustes e dados” ao concluir
ru: Показывать в Finder файл, созданный функцией «Экспортировать все настройки и данные», по завершении экспорта
zh_hans: 完成“导出所有设置和数据”后，在Finder中显示所创建文件。
